---
kind: other
id: Methods.T:Autodesk.Revit.DB.FilteredElementCollector
zh: 筛选、过滤
source: html/16ee3d6e-a95d-0e58-3637-2ac1109f2f8d.htm
---
# FilteredElementCollector Methods

**中文**: 筛选、过滤

Applies an ElementDesignOptionFilter to the collector.